static_calculation/static_calculation.org
#+title: Simple Static Energy and Force Calculation Using =QUICKSTEP=
#+author: Lianheng Tong
#+date: Sunday, 2014/01/26

* Introduction

  In this tutorial, we are going to show the reader how to perform a
  simple static self-consistent Kohn-Sham Density Functional Theory
  energy and force calculation on a system using =QUICKSTEP=.
  
  We will use face centred cubic bulk Si, with 8 atoms in a cubic unit
  cell as an example. The example files are contained in
  =static_calculation.tgz=. The calculations were carried out with
  =CP2K= SVN trunk revision 13180.
  
  The reader should note that the integration grid settings used in
  the example calculations have already chosen to be sufficient for
  the given accuracy. A separate [[converging_cutoff][tutorial]] is available to show how to
  achieve this.

