static_calculation/static_calculation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Simple Static Energy and Force Calculation Using <code>QUICKSTEP</code></title>
<!-- 2014-01-27 Mon 01:47 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Lianheng Tong" />


<!-- The org-mode default configuration, with some of my modifications -->

<!-- switching on equation numbers support -->

<!-- Loading mathjax javascript using preamble and my math definitions -->
</head>
<body>
<div id="content">
<h1 class="title">Simple Static Energy and Force Calculation Using <code>QUICKSTEP</code></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Input Files</a></li>
<li><a href="#sec-3">3. Running the Calculation</a></li>
<li><a href="#sec-4">4. Obtaining the Results</a></li>
<li><a href="#sec-5">5. Adding Smearing</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
In this tutorial, we are going to show the reader how to perform a
simple static self-consistent Kohn-Sham Density Functional Theory
energy and force calculation on a system using <code>QUICKSTEP</code>.
</p>

<p>
We will use face centred cubic bulk Si, with 8 atoms in a cubic unit
cell as an example. The example files are contained in
<code>static_calculation.tgz</code>. The calculations were carried out with
<code>CP2K</code> SVN trunk revision 13180.
</p>

<p>
The reader should note that the integration grid settings used in
the example calculations have already chosen to be sufficient for
the given accuracy. A separate <i>tutorial</i> is available to show how to
achieve this.
</p>
</div>
</div>
