static_calculation/static_calculation.html
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Input Files</h2>
<div class="outline-text-2" id="text-2">
<p>
We first look at the input files required for this calculation. The
necessary input files are:
</p>

<ul class="org-ul">
<li><code>Si_bulk8.inp</code>: the main input file for the calculation, which
defines the system and the job parameters
</li>
<li><code>BASIS_SET</code>: file containing parameters for the basis sets that
can be used by <code>CP2K</code> for this calculation
</li>
<li><code>POTENTIAL</code>: file containing parameters for the pseudopotentials
that can be used by <code>CP2K</code> for this calculation
</li>
</ul>

<p>
A list of basis set and pseudopotential files may be found in
<code>cp2k/tests/QS/</code> that comes with a <code>cp2k</code> source release. These
should cover most of the commonly used elements. The user will,
however, need to produce their own main input file for a given
calculation.
</p>

<p>
Let us look at the main input: <code>Si_bulk8.inp</code> in detail. The name of
this file can be arbitrary, so is the file extension. The input file
is structured into ordered blocks and keywords, the order of which
are unimportant. Each input block is referred to as a "section" in
this tutorial, and some sections are "subsections" of other
sections. Full definitions of the input file format and keywords is
available via the <a href="http://manual.cp2k.org/trunk/index.html"><code>CP2K</code> input reference manual</a>.
</p>

<p>
The input file is shown below:
</p>

<div class="org-src-container">

<pre class="src src-cp2k"><span style="color: #268bd2;">&amp;GLOBAL</span>
  <span style="color: #859900; font-weight: bold;">PROJECT</span> Si_bulk8
  <span style="color: #859900; font-weight: bold;">RUN_TYPE</span> ENERGY_FORCE
  <span style="color: #859900; font-weight: bold;">PRINT_LEVEL</span> LOW
<span style="color: #268bd2;">&amp;END GLOBAL</span>
<span style="color: #268bd2;">&amp;FORCE_EVAL</span>
  <span style="color: #859900; font-weight: bold;">METHOD</span> Quickstep
  <span style="color: #268bd2;">&amp;SUBSYS</span>
    <span style="color: #268bd2;">&amp;KIND</span> Si
      <span style="color: #859900; font-weight: bold;">ELEMENT</span>   Si
      <span style="color: #859900; font-weight: bold;">BASIS_SET</span> DZVP-GTH-PADE
      <span style="color: #859900; font-weight: bold;">POTENTIAL</span> GTH-PADE-q4
    <span style="color: #268bd2;">&amp;END KIND</span>
    <span style="color: #268bd2;">&amp;CELL</span>
      <span style="color: #859900; font-weight: bold;">A</span>     5.430697500    0.000000000    0.000000000
      <span style="color: #859900; font-weight: bold;">B</span>     0.000000000    5.430697500    0.000000000
      <span style="color: #859900; font-weight: bold;">C</span>     0.000000000    0.000000000    5.430697500
    <span style="color: #268bd2;">&amp;END CELL</span>
    <span style="color: #268bd2;">&amp;COORD</span>
      <span style="color: #859900; font-weight: bold;">Si</span>    0.000000000    0.000000000    0.000000000
      <span style="color: #859900; font-weight: bold;">Si</span>    0.000000000    2.715348700    2.715348700
      <span style="color: #859900; font-weight: bold;">Si</span>    2.715348700    2.715348700    0.000000000
      <span style="color: #859900; font-weight: bold;">Si</span>    2.715348700    0.000000000    2.715348700
      <span style="color: #859900; font-weight: bold;">Si</span>    4.073023100    1.357674400    4.073023100
      <span style="color: #859900; font-weight: bold;">Si</span>    1.357674400    1.357674400    1.357674400
      <span style="color: #859900; font-weight: bold;">Si</span>    1.357674400    4.073023100    4.073023100
      <span style="color: #859900; font-weight: bold;">Si</span>    4.073023100    4.073023100    1.357674400
    <span style="color: #268bd2;">&amp;END COORD</span>
  <span style="color: #268bd2;">&amp;END SUBSYS</span>
  <span style="color: #268bd2;">&amp;DFT</span>
    <span style="color: #859900; font-weight: bold;">BASIS_SET_FILE_NAME</span>  BASIS_SET
    <span style="color: #859900; font-weight: bold;">POTENTIAL_FILE_NAME</span>  GTH_POTENTIALS
    <span style="color: #268bd2;">&amp;QS</span>
      <span style="color: #859900; font-weight: bold;">EPS_DEFAULT</span> 1.0E-10
    <span style="color: #268bd2;">&amp;END QS</span>
    <span style="color: #268bd2;">&amp;MGRID</span>
      <span style="color: #859900; font-weight: bold;">NGRIDS</span> 4
      <span style="color: #859900; font-weight: bold;">CUTOFF</span> 300
      <span style="color: #859900; font-weight: bold;">REL_CUTOFF</span> 60
    <span style="color: #268bd2;">&amp;END MGRID</span>
    <span style="color: #268bd2;">&amp;XC</span>
      <span style="color: #268bd2;">&amp;XC_FUNCTIONAL</span> PADE
      <span style="color: #268bd2;">&amp;END XC_FUNCTIONAL</span>
    <span style="color: #268bd2;">&amp;END XC</span>
    <span style="color: #268bd2;">&amp;SCF</span>
      <span style="color: #859900; font-weight: bold;">SCF_GUESS</span> ATOMIC
      <span style="color: #859900; font-weight: bold;">EPS_SCF</span> 1.0E-7
      <span style="color: #859900; font-weight: bold;">MAX_SCF</span> 300
      <span style="color: #268bd2;">&amp;DIAGONALIZATION</span>  ON
        <span style="color: #859900; font-weight: bold;">ALGORITHM</span> STANDARD
      <span style="color: #268bd2;">&amp;END DIAGONALIZATION</span>
      <span style="color: #268bd2;">&amp;MIXING</span>  T
        <span style="color: #859900; font-weight: bold;">METHOD</span> BROYDEN_MIXING
        <span style="color: #859900; font-weight: bold;">ALPHA</span> 0.4
        <span style="color: #859900; font-weight: bold;">NBROYDEN</span> 8
      <span style="color: #268bd2;">&amp;END MIXING</span>
    <span style="color: #268bd2;">&amp;END SCF</span>
  <span style="color: #268bd2;">&amp;END DFT</span>
  <span style="color: #268bd2;">&amp;PRINT</span>
    <span style="color: #268bd2;">&amp;FORCES</span> ON
    <span style="color: #268bd2;">&amp;END FORCES</span>
  <span style="color: #268bd2;">&amp;END PRINT</span>
<span style="color: #268bd2;">&amp;END FORCE_EVAL</span>
</pre>
</div>

<p>
The main sections in the input file are:
</p>

<ul class="org-ul">
<li><a href="http://manual.cp2k.org/trunk/CP2K_INPUT/GLOBAL.html"><code>GLOBAL</code></a>: contains general options for the <code>CP2K</code> run, such as the
name of the job, the type of run etc.
</li>
<li><a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL.html"><code>FORCE_EVAL</code></a>: contains all parameters associated with the
evaluation of forces on atoms, this includes the initial atomic
coordinates.
</li>
</ul>

<p>
We look at each section in detail. The <code>GLOBAL</code> section in
<code>Si_bulk8.inp</code> is presented below:
</p>

<div class="org-src-container">

<pre class="src src-cp2k"><span style="color: #268bd2;">&amp;GLOBAL</span>
  <span style="color: #859900; font-weight: bold;">PROJECT</span> Si_bulk8
  <span style="color: #859900; font-weight: bold;">RUN_TYPE</span> ENERGY_FORCE
  <span style="color: #859900; font-weight: bold;">PRINT_LEVEL</span> LOW
<span style="color: #268bd2;">&amp;END GLOBAL</span>
</pre>
</div>

<p>
We will be doing a static energy and force calculation, in this
case, we must set <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/GLOBAL.html#desc_RUN_TYPE"><code>RUNTYPE</code></a> to <code>ENERGY_FORCE</code>. Keyword <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/GLOBAL.html#desc_PROJECT_NAME"><code>PROJECT</code></a> is an
alias for <code>PROJECT_NAME</code>, which sets the root-name of the
calculation, in this case <code>Si_bulk8</code>. Any output files automatically
generated by <code>CP2K</code> will have the name prefixed by
<code>Si_bulk8</code>. <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/GLOBAL.html#desc_PRINT_LEVEL"><code>PRINT_LEVEL</code></a> controls the default verbosity of the main
output of <code>CP2K</code>, in this example, it is set to "low". The
verbosity of the output can be fine-tuned by overriding this setting
in each individual subsection of the input.
</p>

<p>
We now explain the section <code>FORCE_EVAL</code> line-by-line.
</p>

<div class="org-src-container">

<pre class="src src-cp2k"><span style="color: #859900; font-weight: bold;">METHOD</span> Quickstep
</pre>
</div>

<p>
The keyword <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL.html#desc_METHOD"><code>METHOD</code></a> chooses the method for evaluating the forces on
atoms to <code>QUICKSTEP</code>, i.e. Density Functional Theory using the
Gaussian and Planewaves (GPW) method.
</p>

<div class="org-src-container">

<pre class="src src-cp2k"><span style="color: #268bd2;">&amp;SUBSYS</span>
  <span style="color: #268bd2;">&amp;KIND</span> Si
    <span style="color: #859900; font-weight: bold;">ELEMENT</span>   Si
    <span style="color: #859900; font-weight: bold;">BASIS_SET</span> DZVP-GTH-PADE
    <span style="color: #859900; font-weight: bold;">POTENTIAL</span> GTH-PADE-q4
  <span style="color: #268bd2;">&amp;END KIND</span>
  <span style="color: #268bd2;">&amp;CELL</span>
    <span style="color: #859900; font-weight: bold;">A</span>     5.430697500    0.000000000    0.000000000
    <span style="color: #859900; font-weight: bold;">B</span>     0.000000000    5.430697500    0.000000000
    <span style="color: #859900; font-weight: bold;">C</span>     0.000000000    0.000000000    5.430697500
  <span style="color: #268bd2;">&amp;END CELL</span>
  <span style="color: #268bd2;">&amp;COORD</span>
    <span style="color: #859900; font-weight: bold;">Si</span>    0.000000000    0.000000000    0.000000000
    <span style="color: #859900; font-weight: bold;">Si</span>    0.000000000    2.715348700    2.715348700
    <span style="color: #859900; font-weight: bold;">Si</span>    2.715348700    2.715348700    0.000000000
    <span style="color: #859900; font-weight: bold;">Si</span>    2.715348700    0.000000000    2.715348700
    <span style="color: #859900; font-weight: bold;">Si</span>    4.073023100    1.357674400    4.073023100
    <span style="color: #859900; font-weight: bold;">Si</span>    1.357674400    1.357674400    1.357674400
    <span style="color: #859900; font-weight: bold;">Si</span>    1.357674400    4.073023100    4.073023100
    <span style="color: #859900; font-weight: bold;">Si</span>    4.073023100    4.073023100    1.357674400
  <span style="color: #268bd2;">&amp;END COORD</span>
<span style="color: #268bd2;">&amp;END SUBSYS</span>
</pre>
</div>

<p>
The subsection <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/SUBSYS.html"><code>SUBSYS</code></a> defines the simulation unit cell and the
initial coordinates of atoms in the calculation. 
</p>

<p>
The subsection <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/SUBSYS/KIND.html"><code>KIND</code></a> gives definitions of elements in the
calculation. There must be one <code>KIND</code> subsection per element. In
this example, for Si, we have defined the basis set to be used:
<code>DZVP_GTH-PADE</code> (double-\(\zeta\) with polarisation basis optimised
for Geodecker-Teter-Hutter PADE LDA pseudopotential); and the
pseudopotential: <code>GTH-PADE-q4</code> (Geodecker-Teter-Hutter PADE LDA
pseudopotential with 4 valence electrons).
</p>

<p>
The basis set and pseudopotential names <i>must</i> correspond to an
existing entry in the corresponding basis set and pseudopotential
files defined by <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/DFT.html#desc_BASIS_SET_FILE_NAME"><code>BASIS_SET_FILE_NAME</code></a> and <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/DFT.html#desc_POTENTIAL_FILE_NAME"><code>POTENTIAL_FILE_NAME</code></a>
keywords in <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/DFT.html"><code>DFT</code></a> subsection, in <code>FORCE_EVAL</code> section. The chosen
basis for Si corresponds to parameters:
</p>

<pre class="example">
Si DZVP-GTH-PADE
  2
  3  0  1  4  2  2
        1.2032422345   0.3290350445   0.0000000000   0.0474539126   0.0000000000
        0.4688409786  -0.2533118323   0.0000000000  -0.2594473573   0.0000000000
        0.1679863234  -0.7870946277   0.0000000000  -0.5440929303   0.0000000000
        0.0575619526  -0.1909898479   1.0000000000  -0.3624010364   1.0000000000
  3  2  2  1  1
        0.4500000000   1.0000000000
</pre>

<p>
in file <code>BASIS_SETS</code>; and the chosen pseudopotential corresponds to
parameters:
</p>

<pre class="example">
Si GTH-PADE-q4 GTH-LDA-q4
    2    2
     0.44000000    1    -7.33610297
    2
     0.42273813    2     5.90692831    -1.26189397
                                        3.25819622
     0.48427842    1     2.72701346
</pre>

<p>
in file <code>GTH_POTENTIAL</code>.
</p>

<p>
The subsection <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/SUBSYS/CELL.html"><code>CELL</code></a> defines the simulation unit cell used in a
calculation.  In this example, we define the unit cell as cubic,
with lattice constant equal to 5.4306975 Angstroms. "Angstrom" is
the default unit for cell vectors. <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/SUBSYS/CELL.html#desc_A"><code>A</code></a>, <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/SUBSYS/CELL.html#desc_B"><code>B</code></a> and <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/SUBSYS/CELL.html#desc_C"><code>C</code></a> are the first,
second and third lattice (cell) vectors. There are many ways to
define the cell, see <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/SUBSYS/CELL.html"><code>CP2K</code> input reference manual</a> for more details.
</p>

<p>
The initial atomic coordinates are specified in the <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/SUBSYS/COORD.html"><code>COORD</code></a>
subsection. The default input format for atomic coordinates in
<code>CP2K</code> is:
</p>
<pre class="example">
&lt;ATOM_KIND&gt; X Y Z
</pre>
<p>
where <code>X</code>, <code>Y</code> and <code>Z</code> are Cartesian coordinates in Angstroms. This
can be changed by configuring keyword <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/SUBSYS/COORD.html#desc_SCALED"><code>SCALED</code></a> to <code>.TRUE.</code>, in the
<code>COORD</code> subsection, which makes the coordinate input <code>X</code> <code>Y</code> <code>Z</code> to
be fractional with respect to the lattice vectors. One can also
change the unit for the Cartesian coordinates by setting the keyword
<a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/SUBSYS/COORD.html#desc_UNIT"><code>UNIT</code></a> with in the subsection. <code>&lt;ATOM_KIND&gt;</code> should be a label that
corresponds to the definition of the elements in the <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/SUBSYS/KIND.html"><code>KIND</code></a>
subsections.
</p>

<p>
After the <code>SUBSYS</code> section in the input file <code>Si_bulk8.inp</code> follows
the <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/DFT.html"><code>DFT</code></a> subsection, which controls all aspects of the
self-consistent Kohn-Sham Density Functional Theory
calculation. This subsection is only relevant if and only if the
<code>METHOD</code> keyword in <code>FORCE_EVAL</code> is set to <code>QUICKSTEP</code>.
</p>

<div class="org-src-container">

<pre class="src src-cp2k"><span style="color: #859900; font-weight: bold;">BASIS_SET_FILE_NAME</span>  BASIS_SET
<span style="color: #859900; font-weight: bold;">POTENTIAL_FILE_NAME</span>  GTH_POTENTIALS
</pre>
</div>

<p>
As already mentioned above, the keywords <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/DFT.html#desc_BASIS_SET_FILE_NAME"><code>BASIS_SET_FILE_NAME</code></a> and
<a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/DFT.html#desc_POTENTIAL_FILE_NAME"><code>POTENTIAL_FILE_NAME</code></a> set the files that contains basis set and
pseudopotential parameters.
</p>

<div class="org-src-container">

<pre class="src src-cp2k"><span style="color: #268bd2;">&amp;QS</span>
  <span style="color: #859900; font-weight: bold;">EPS_DEFAULT</span> 1.0E-10
<span style="color: #268bd2;">&amp;END QS</span>
</pre>
</div>

<p>
The <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/DFT/QS.html"><code>QS</code></a> subsection contains general control parameters used by
<code>QUICKSTEP</code>. <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/DFT/QS.html#desc_EPS_DEFAULT"><code>EPS_DEFAULT</code></a> sets the default value for all tolerances
used within <code>QUICKSTEP</code>. The individual tolerances (<code>EPS_*</code>) can be
set, and they will override the <code>EPS_DEFAULT</code> value.
</p>

<div class="org-src-container">

<pre class="src src-cp2k"><span style="color: #268bd2;">&amp;MGRID</span>
  <span style="color: #859900; font-weight: bold;">NGRIDS</span> 4
  <span style="color: #859900; font-weight: bold;">CUTOFF</span> 300
  <span style="color: #859900; font-weight: bold;">REL_CUTOFF</span> 60
<span style="color: #268bd2;">&amp;END MGRID</span>
</pre>
</div>

<p>
The <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/DFT/MGRID.html"><code>MGRID</code></a> subsection defines how the integration grid used in
<code>QUICKSTEP</code> calculations should be setup. <code>QUICKSTEP</code> uses a
multi-grid method for representing Gaussian functions numerically on
the grid. Narrow and sharp Gaussians are mapped onto a finer grid
than wider and smoother Gaussians. In this case, we are telling the
code to set up 4 levels of multi-grids, with the planewave cutoff of
the finest grid set to be 300 Ry, and with the grid spacing
underneath any Gaussian functions to be finer than the equivalent
planewave cutoff of 60 Ry. The users should read the tutorial
"<i>Converging the CUTOFF and REL_CUTOFF</i>" for details on how these
parameters affect the grid constructed, and how to define a
sufficient grid for their calculation. In this example, the grid
defined has already been found to be sufficient for the energy and
force calculation.
</p>

<p>
The <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/DFT/XC.html"><code>XC</code></a> subsection follows:
</p>

<div class="org-src-container">

<pre class="src src-cp2k"><span style="color: #268bd2;">&amp;XC</span>
  <span style="color: #268bd2;">&amp;XC_FUNCTIONAL</span> PADE
  <span style="color: #268bd2;">&amp;END XC_FUNCTIONAL</span>
<span style="color: #268bd2;">&amp;END XC</span>
</pre>
</div>

<p>
This defines which exchange-correlation density functional we want
to use. In this we choose PADE LDA functional, which is consistent
with the basis set and pseudopotential we have chosen.
</p>

<div class="org-src-container">

<pre class="src src-cp2k"><span style="color: #268bd2;">&amp;SCF</span>
  <span style="color: #859900; font-weight: bold;">SCF_GUESS</span> ATOMIC
  <span style="color: #859900; font-weight: bold;">EPS_SCF</span> 1.0E-7
  <span style="color: #859900; font-weight: bold;">MAX_SCF</span> 300
  <span style="color: #268bd2;">&amp;DIAGONALIZATION</span>
    <span style="color: #859900; font-weight: bold;">ALGORITHM</span> STANDARD
  <span style="color: #268bd2;">&amp;END DIAGONALIZATION</span>
  <span style="color: #268bd2;">&amp;MIXING</span>
    <span style="color: #859900; font-weight: bold;">METHOD</span> BROYDEN_MIXING
    <span style="color: #859900; font-weight: bold;">ALPHA</span> 0.4
    <span style="color: #859900; font-weight: bold;">NBROYDEN</span> 8
  <span style="color: #268bd2;">&amp;END MIXING</span>
<span style="color: #268bd2;">&amp;END SCF</span>
</pre>
</div>

<p>
The <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/DFT/SCF.html"><code>SCF</code></a> subsection defines all the settings related to methods
used to find a self-consistent solution of the Kohn-Sham DFT
formalism.
</p>

<p>
<a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/DFT/SCF.html#desc_SCF_GUESS"><code>SCF_GUESS</code></a> sets how the initial trial electron density function
\(\rho(\vec{r})\) is to be generated. In this example (<code>ATOMIC</code>), the
initial density is to be generated using overlapping of atomic
charge densities. A good starting point for the electron density in
the self-consistency loop is important in obtaining a convergent
result quickly.  <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/DFT/SCF.html#desc_EPS_SCF"><code>EPS_SCF</code></a> sets the tolerance of the charge density
residual. This overrides the <code>EPS_DEFAULT</code> value set in <code>QS</code>
subsection. <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/DFT/SCF.html#desc_MAX_SCF"><code>MAX_SCF</code></a> sets the maximum number of self-consistency
loops <code>QUICKSTEP</code> is allowed to perform for each ground-state energy
calculation.
</p>

<div class="org-src-container">

<pre class="src src-cp2k"><span style="color: #268bd2;">&amp;DIAGONALIZATION</span>  ON
  <span style="color: #859900; font-weight: bold;">ALGORITHM</span> STANDARD
<span style="color: #268bd2;">&amp;END DIAGONALIZATION</span>
</pre>
</div>

<p>
The <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/DFT/SCF/DIAGONALIZATION.html"><code>DIAGONALIZATION</code></a> subsection tells the code to use the
traditional diagonalisation method for finding the ground state
Kohn-Sham energy and electron density. The subsection heading also
takes an argument, and in this case is set to "<code>ON</code>", which
equivalent to "<code>.TRUE.</code>" or "<code>T</code>", and indicates that the
diagonalisation method is turned on. One can also omit the value of
the subsection heading, which defaults to "<code>.TRUE.</code>". The
alternative to diagonalisation is to use the Orbital Transform (OT)
method, in which case, the user should either delete the
<code>DIAGONALIZATION</code> block or change "<code>ON</code>" to "<code>OFF</code>" (or
"<code>.FALSE.</code>"), and add the <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/DFT/SCF/DIAGONALIZATION/OT.html"><code>OT</code></a> subsection instead. The <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/DFT/SCF/DIAGONALIZATION.html#desc_ALGORITHM"><code>ALGORITHM</code></a>
keyword sets the algorithm to use for diagonalisation of the
Kohn-Sham Hamiltonian. "<code>STANDARD</code>" means the standard
LAPACK/SCALAPACK subroutines are to be used for diagonalisation.
</p>

<div class="org-src-container">

<pre class="src src-cp2k"><span style="color: #268bd2;">&amp;MIXING</span>  T
  <span style="color: #859900; font-weight: bold;">METHOD</span> BROYDEN_MIXING
  <span style="color: #859900; font-weight: bold;">ALPHA</span> 0.4
  <span style="color: #859900; font-weight: bold;">NBROYDEN</span> 8
<span style="color: #268bd2;">&amp;END MIXING</span>
</pre>
</div>

<p>
The <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/DFT/SCF/MIXING.html"><code>MIXING</code></a> subsection contains all the parameters associated with
charge mixing in a self-consistency calculation. The subsection also
admits a value, which can be either <code>.TRUE.</code> (<code>T</code>) or <code>.FALSE.</code>
(<code>F</code>), which switches charge mixing on or off. The default is
<code>.TRUE.</code>. Note that this subsection <i>only applies to the traditional
diagonalisation method</i>. The OT method uses a different approach for
charge mixing, and is explained in other tutorials. The keyword
<a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/DFT/SCF/MIXING.html#desc_ALPHA"><code>ALPHA</code></a> sets the mixing parameter; in this example 0.4 of the output
density will be mixed with 0.6 of the input density to form the new
input density in the next SCF iteration. The keyword <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/DFT/SCF/MIXING.html#desc_METHOD"><code>METHOD</code></a> sets
the mixing method; in this case, we will use Broyden mixing. The
keyword <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/DFT/SCF/MIXING.html#desc_NBUFFER"><code>NBROYDEN</code></a> is an alias to the parameter <code>NBUFFER</code>, and it
sets the number of histories to be used in the Broyden mixing
algorithm.
</p>

<p>
The final <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/PRINT.html"><code>PRINT</code></a> subsection in <code>FORCE_EVAL</code> section:
</p>

<div class="org-src-container">

<pre class="src src-cp2k"><span style="color: #268bd2;">&amp;PRINT</span>
  <span style="color: #268bd2;">&amp;FORCES</span> ON
  <span style="color: #268bd2;">&amp;END FORCES</span>
<span style="color: #268bd2;">&amp;END PRINT</span>
</pre>
</div>

<p>
tells <code>CP2K</code>, in this case, to print out atomic forces in the main
output of the calculation.
</p>
</div>
</div>
