static_calculation/static_calculation.org
* Running the Calculation

  To run the calculation, the reader needs to have a working =CP2K=
  package compiled, and with the path to its binaries in the system
  =PATH=. The files =Si_bulk8.inp=, =BASIS_SET= and =GTH_POTENTIAL=
  should be in the same working directory. In this example, we will
  use the MPI version of =CP2K=. Type command:
  #+BEGIN_EXAMPLE
    mpirun -n 2 -o Si_bulk8.out Si_bulk8.inp &
  #+END_EXAMPLE
  in the working directory to run =CP2K= in parallel with 2 MPI
  processes in the background. The =-o= option redirects the =CP2K=
  output to file =Si_bulk8.out=. Note that the =-o= option /appends/
  output of successive runs to =Si_bulk8.out=, so if the reader wants
  to start completely from afresh, they must delete =Si_bulk8.out=
  before running a new calculation.

* Obtaining the Results

  After the job has finished, we should obtain the following files:
  
  - =Si_bulk8.out=
  - =Si_bulk8-RESTART.wfn=
  - =Si_bulk8-RESTART.wfn.bak-1=

  The file =Si_bulk8.out= contains the main output of the
  job. =Si_bulk8-RESTART.wfn= is the final Kohn-Sham wavefunctions
  from the calculation. =Si_bulk8-RESTART.wfn.bak-<n>= records the
  Kohn-Sham wavefunctions obtained from the =<n>=-th previous SCF
  step; in this case, =Si_bulk8-RESTART.wfn.bak-1= contains the
  wavefunctions obtained from the last SCF step. Should the reader
  want to start a new calculation from the previous calculated
  wavefunctions, they need to change the =SCF_GUESS= keyword in =SCF=
  subsection of =FORCE_EVAL= section to =RESTART=:
  #+BEGIN_SRC cp2k
    SCF_GUESS RESTART
  #+END_SRC
  provided that the new calculation shares the same =PROJECT_NAME= as
  the one that generated the wavefunctions. Otherwise, we would need
  to rename the restart wavefunction files to correspond to the
  project name of the new calculation.

  We now look at the main =CP2K= output in more detail.

  #+BEGIN_EXAMPLE
     Number of electrons:                                                         32
     Number of occupied orbitals:                                                 16
     Number of molecular orbitals:                                                16
    
     Number of orbital functions:                                                104
     Number of independent orbital functions:                                    104
    
     Extrapolation method: initial_guess
    
    
     SCF WAVEFUNCTION OPTIMIZATION
    
      Step     Update method      Time    Convergence         Total energy    Change
      ------------------------------------------------------------------------------
         1 NoMix/Diag. 0.40E+00    0.6     0.75558724       -32.2320848878 -3.22E+01
         2 Broy./Diag. 0.40E+00    1.1     0.05667976       -31.1418135481  1.09E+00
         3 Broy./Diag. 0.40E+00    1.1     0.09691469       -31.1974003416 -5.56E-02
         4 Broy./Diag. 0.40E+00    1.1     0.00245608       -31.3378474040 -1.40E-01
         5 Broy./Diag. 0.40E+00    1.1     0.00235460       -31.3009654398  3.69E-02
         6 Broy./Diag. 0.40E+00    1.1     0.00007565       -31.2972158934  3.75E-03
         7 Broy./Diag. 0.40E+00    1.1     0.00009004       -31.2977293749 -5.13E-04
         8 Broy./Diag. 0.40E+00    1.1     0.00000186       -31.2978454163 -1.16E-04
         9 Broy./Diag. 0.40E+00    1.1     0.00000252       -31.2978835492 -3.81E-05
        10 Broy./Diag. 0.40E+00    1.1     5.6405E-09       -31.2978852054 -1.66E-06
    
      ,*** SCF run converged in    10 steps ***
  #+END_EXAMPLE

  The above shows a typical output from a self-consistent Kohn-Sham
  ground state calculation. It states that we are using
  diagonalisation method with Broyden charge mixing, and it took 10
  Broyden mixing steps (each containing a diagonalisation process to
  obtain the wavefunctions) to reach the required tolerance for
  self-consistency.

  #+BEGIN_EXAMPLE
      Electronic density on regular grids:        -31.9999999889        0.0000000111
      Core density on regular grids:               31.9999999939       -0.0000000061
      Total charge density on r-space grids:        0.0000000051
      Total charge density g-space grids:           0.0000000051
    
      Overlap energy of the core charge distribution:               0.00000000005320
      Self energy of the core charge distribution:                -82.06393942512820
      Core Hamiltonian energy:                                     18.06858429706010
      Hartree energy:                                              42.41172824581682
      Exchange-correlation energy:                                 -9.71425832315952
    
      Total energy:                                               -31.29788520535761
    
     ENERGY| Total FORCE_EVAL ( QS ) energy (a.u.):              -31.297885372811002
    
    
     ATOMIC FORCES in [a.u.]
    
     # Atom   Kind   Element          X              Y              Z
          1      1      Si          0.00000000     0.00000000     0.00000000
          2      1      Si          0.00000000     0.00000001     0.00000001
          3      1      Si          0.00000001     0.00000001     0.00000000
          4      1      Si          0.00000001     0.00000000     0.00000001
          5      1      Si         -0.00000001    -0.00000001    -0.00000001
          6      1      Si         -0.00000001    -0.00000001    -0.00000001
          7      1      Si         -0.00000001    -0.00000001    -0.00000001
          8      1      Si         -0.00000001    -0.00000001    -0.00000001
     SUM OF ATOMIC FORCES          -0.00000000    -0.00000000    -0.00000000     0.00000000
  #+END_EXAMPLE

  The above shows the results on final energies and forces.  One
  should always check if the total number of electrons calculated from
  the final electron density, in this case 31.9999999939, is correct.

  The results show that the force on the atoms are almost zero. This
  means the system is more or less relaxed, and its geometry is close
  to its optimal at ground state.

