static_calculation/static_calculation.html
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Running the Calculation</h2>
<div class="outline-text-2" id="text-3">
<p>
To run the calculation, the reader needs to have a working <code>CP2K</code>
package compiled, and with the path to its binaries in the system
<code>PATH</code>. The files <code>Si_bulk8.inp</code>, <code>BASIS_SET</code> and <code>GTH_POTENTIAL</code>
should be in the same working directory. In this example, we will
use the MPI version of <code>CP2K</code>. Type command:
</p>
<pre class="example">
mpirun -n 2 -o Si_bulk8.out Si_bulk8.inp &amp;
</pre>
<p>
in the working directory to run <code>CP2K</code> in parallel with 2 MPI
processes in the background. The <code>-o</code> option redirects the <code>CP2K</code>
output to file <code>Si_bulk8.out</code>. Note that the <code>-o</code> option <i>appends</i>
output of successive runs to <code>Si_bulk8.out</code>, so if the reader wants
to start completely from afresh, they must delete <code>Si_bulk8.out</code>
before running a new calculation.
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Obtaining the Results</h2>
<div class="outline-text-2" id="text-4">
<p>
After the job has finished, we should obtain the following files:
</p>

<ul class="org-ul">
<li><code>Si_bulk8.out</code>
</li>
<li><code>Si_bulk8-RESTART.wfn</code>
</li>
<li><code>Si_bulk8-RESTART.wfn.bak-1</code>
</li>
</ul>

<p>
The file <code>Si_bulk8.out</code> contains the main output of the
job. <code>Si_bulk8-RESTART.wfn</code> is the final Kohn-Sham wavefunctions
from the calculation. <code>Si_bulk8-RESTART.wfn.bak-&lt;n&gt;</code> records the
Kohn-Sham wavefunctions obtained from the <code>&lt;n&gt;</code>-th previous SCF
step; in this case, <code>Si_bulk8-RESTART.wfn.bak-1</code> contains the
wavefunctions obtained from the last SCF step. Should the reader
want to start a new calculation from the previous calculated
wavefunctions, they need to change the <code>SCF_GUESS</code> keyword in <code>SCF</code>
subsection of <code>FORCE_EVAL</code> section to <code>RESTART</code>:
</p>
<div class="org-src-container">

<pre class="src src-cp2k"><span style="color: #859900; font-weight: bold;">SCF_GUESS</span> RESTART
</pre>
</div>
<p>
provided that the new calculation shares the same <code>PROJECT_NAME</code> as
the one that generated the wavefunctions. Otherwise, we would need
to rename the restart wavefunction files to correspond to the
project name of the new calculation.
</p>

<p>
We now look at the main <code>CP2K</code> output in more detail.
</p>

<pre class="example">
Number of electrons:                                                         32
Number of occupied orbitals:                                                 16
Number of molecular orbitals:                                                16

Number of orbital functions:                                                104
Number of independent orbital functions:                                    104

Extrapolation method: initial_guess


SCF WAVEFUNCTION OPTIMIZATION

 Step     Update method      Time    Convergence         Total energy    Change
 ------------------------------------------------------------------------------
    1 NoMix/Diag. 0.40E+00    0.6     0.75558724       -32.2320848878 -3.22E+01
    2 Broy./Diag. 0.40E+00    1.1     0.05667976       -31.1418135481  1.09E+00
    3 Broy./Diag. 0.40E+00    1.1     0.09691469       -31.1974003416 -5.56E-02
    4 Broy./Diag. 0.40E+00    1.1     0.00245608       -31.3378474040 -1.40E-01
    5 Broy./Diag. 0.40E+00    1.1     0.00235460       -31.3009654398  3.69E-02
    6 Broy./Diag. 0.40E+00    1.1     0.00007565       -31.2972158934  3.75E-03
    7 Broy./Diag. 0.40E+00    1.1     0.00009004       -31.2977293749 -5.13E-04
    8 Broy./Diag. 0.40E+00    1.1     0.00000186       -31.2978454163 -1.16E-04
    9 Broy./Diag. 0.40E+00    1.1     0.00000252       -31.2978835492 -3.81E-05
   10 Broy./Diag. 0.40E+00    1.1     5.6405E-09       -31.2978852054 -1.66E-06

 *** SCF run converged in    10 steps ***
</pre>

<p>
The above shows a typical output from a self-consistent Kohn-Sham
ground state calculation. It states that we are using
diagonalisation method with Broyden charge mixing, and it took 10
Broyden mixing steps (each containing a diagonalisation process to
obtain the wavefunctions) to reach the required tolerance for
self-consistency.
</p>

<pre class="example">
 Electronic density on regular grids:        -31.9999999889        0.0000000111
 Core density on regular grids:               31.9999999939       -0.0000000061
 Total charge density on r-space grids:        0.0000000051
 Total charge density g-space grids:           0.0000000051

 Overlap energy of the core charge distribution:               0.00000000005320
 Self energy of the core charge distribution:                -82.06393942512820
 Core Hamiltonian energy:                                     18.06858429706010
 Hartree energy:                                              42.41172824581682
 Exchange-correlation energy:                                 -9.71425832315952

 Total energy:                                               -31.29788520535761

ENERGY| Total FORCE_EVAL ( QS ) energy (a.u.):              -31.297885372811002


ATOMIC FORCES in [a.u.]

# Atom   Kind   Element          X              Y              Z
     1      1      Si          0.00000000     0.00000000     0.00000000
     2      1      Si          0.00000000     0.00000001     0.00000001
     3      1      Si          0.00000001     0.00000001     0.00000000
     4      1      Si          0.00000001     0.00000000     0.00000001
     5      1      Si         -0.00000001    -0.00000001    -0.00000001
     6      1      Si         -0.00000001    -0.00000001    -0.00000001
     7      1      Si         -0.00000001    -0.00000001    -0.00000001
     8      1      Si         -0.00000001    -0.00000001    -0.00000001
SUM OF ATOMIC FORCES          -0.00000000    -0.00000000    -0.00000000     0.00000000
</pre>

<p>
The above shows the results on final energies and forces.  One
should always check if the total number of electrons calculated from
the final electron density, in this case 31.9999999939, is correct.
</p>

<p>
The results show that the force on the atoms are almost zero. This
means the system is more or less relaxed, and its geometry is close
to its optimal at ground state.
</p>
</div>
</div>
