static_calculation/static_calculation.org
* Adding Smearing

  In the example so far, we have not used any smearing on electron
  occupation. This is fine for system with a large band gap. However,
  for metals or systems with a small gap, this may cause the
  calculation to be unstable, and the self-consistency loop may never
  converge, due to the discontinuity in the electron occupation
  function.

  To add smearing, we need to add the subsection [[http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/DFT/SCF/SMEAR.html][=SMEAR=]] inside
  subsection =SCF=:
  
  #+BEGIN_SRC cp2k
          &SMEAR ON
            METHOD FERMI_DIRAC
            ELECTRONIC_TEMPERATURE [K] 300
          &END SMEAR
  #+END_SRC
  
  This tells =QUICKSTEP= to use a smearing function for the electron
  occupation. In this example, we use the Fermi-Dirac smearing
  function, with the electron temperature being set to 300 K. Note
  that, in =CP2K=, one can explicitly define the unit of a given input
  value by using a unit enclosed in square bracket, such as "=[K]=",
  before the value.

  This is not all, since smearing may lead to occupation of molecular
  orbitals in the conduction band, we must tell =CP2K= to include
  extra, empty, molecular orbitals into the calculation, which
  otherwise would be omitted (for reducing computational cost). To do
  this, we need to add the keyword [[http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/DFT/SCF.html#desc_ADDED_MOS][=ADDED_MOS=]] in the =SCF=
  subsection:

  #+BEGIN_SRC cp2k
          ADDED_MOS 10
  #+END_SRC

  In this example, we have asked =CP2K= to not to omit 10 of the
  lowest empty molecular orbitals in the calculation. It should be
  noted that given a chosen basis set, there is a maximum number of
  molecular orbitals, i.e. the number of eigenvectors of the
  Hamiltonian, one can generate. In theory, the maximum should be the
  rank of the Hamiltonian generated in the calculation.

  In the output of the calculation using smearing, we first notice
  that:
  
  #+BEGIN_EXAMPLE
    Number of electrons:                                                         32
    Number of occupied orbitals:                                                 16
    Number of molecular orbitals:                                                26
    
    Number of orbital functions:                                                104
    Number of independent orbital functions:                                    104
  #+END_EXAMPLE

  unlike in the previous case with no smearing, now 26 molecular
  orbitals have been used during the calculation. There are a total of
  104 basis functions ("atom centred orbitals" spanned by Cartesian
  Gaussians) used in the calculation for the given basis set, so 26 is
  well within the limit of the calculation.

  #+BEGIN_EXAMPLE
      Electronic density on regular grids:        -31.9999999889        0.0000000111
      Core density on regular grids:               31.9999999939       -0.0000000061
      Total charge density on r-space grids:        0.0000000051
      Total charge density g-space grids:           0.0000000051
    
      Overlap energy of the core charge distribution:               0.00000000005320
      Self energy of the core charge distribution:                -82.06393942512820
      Core Hamiltonian energy:                                     18.06842027191411
      Hartree energy:                                              42.41184371469986
      Exchange-correlation energy:                                 -9.71419454555998
      Electronic entropic energy:                                  -0.00001687947145
      Fermi energy:                                                 0.20867150262130
    
      Total energy:                                               -31.29788686349247
    
     ENERGY| Total FORCE_EVAL ( QS ) energy (a.u.):              -31.297887031736590
  #+END_EXAMPLE

  In the final energy section of the output, we notice that there is
  an extra entropy $(TS)$ term:
  
  #+BEGIN_EXAMPLE
      Electronic entropic energy:                                  -0.00001687947145
  #+END_EXAMPLE

  This should be small for the calculation to be a reliable
  approximation to the zero electron temperature result. The final
  free energy is the sum of the total DFT energy and the entropic
  energy. The total DFT energy is given by:

  #+BEGIN_EXAMPLE
      Total energy:                                               -31.29788686349247
  #+END_EXAMPLE

  and the final free energy extrapolated for $TS \to 0$ is given by:

  #+BEGIN_EXAMPLE
     ENERGY| Total FORCE_EVAL ( QS ) energy (a.u.):              -31.297887031736590
  #+END_EXAMPLE

  This is the energy to be quoted as the final result.
