static_calculation/static_calculation.html
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Adding Smearing</h2>
<div class="outline-text-2" id="text-5">
<p>
In the example so far, we have not used any smearing on electron
occupation. This is fine for system with a large band gap. However,
for metals or systems with a small gap, this may cause the
calculation to be unstable, and the self-consistency loop may never
converge, due to the discontinuity in the electron occupation
function.
</p>

<p>
To add smearing, we need to add the subsection <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/DFT/SCF/SMEAR.html"><code>SMEAR</code></a> inside
subsection <code>SCF</code>:
</p>

<div class="org-src-container">

<pre class="src src-cp2k"><span style="color: #268bd2;">&amp;SMEAR</span> ON
  <span style="color: #859900; font-weight: bold;">METHOD</span> FERMI_DIRAC
  <span style="color: #859900; font-weight: bold;">ELECTRONIC_TEMPERATURE</span> [K] 300
<span style="color: #268bd2;">&amp;END SMEAR</span>
</pre>
</div>

<p>
This tells <code>QUICKSTEP</code> to use a smearing function for the electron
occupation. In this example, we use the Fermi-Dirac smearing
function, with the electron temperature being set to 300 K. Note
that, in <code>CP2K</code>, one can explicitly define the unit of a given input
value by using a unit enclosed in square bracket, such as "<code>[K]</code>",
before the value.
</p>

<p>
This is not all, since smearing may lead to occupation of molecular
orbitals in the conduction band, we must tell <code>CP2K</code> to include
extra, empty, molecular orbitals into the calculation, which
otherwise would be omitted (for reducing computational cost). To do
this, we need to add the keyword <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/DFT/SCF.html#desc_ADDED_MOS"><code>ADDED_MOS</code></a> in the <code>SCF</code>
subsection:
</p>

<div class="org-src-container">

<pre class="src src-cp2k"><span style="color: #859900; font-weight: bold;">ADDED_MOS</span> 10
</pre>
</div>

<p>
In this example, we have asked <code>CP2K</code> to not to omit 10 of the
lowest empty molecular orbitals in the calculation. It should be
noted that given a chosen basis set, there is a maximum number of
molecular orbitals, i.e. the number of eigenvectors of the
Hamiltonian, one can generate. In theory, the maximum should be the
rank of the Hamiltonian generated in the calculation.
</p>

<p>
In the output of the calculation using smearing, we first notice
that:
</p>

<pre class="example">
Number of electrons:                                                         32
Number of occupied orbitals:                                                 16
Number of molecular orbitals:                                                26

Number of orbital functions:                                                104
Number of independent orbital functions:                                    104
</pre>

<p>
unlike in the previous case with no smearing, now 26 molecular
orbitals have been used during the calculation. There are a total of
104 basis functions ("atom centred orbitals" spanned by Cartesian
Gaussians) used in the calculation for the given basis set, so 26 is
well within the limit of the calculation.
</p>

<pre class="example">
 Electronic density on regular grids:        -31.9999999889        0.0000000111
 Core density on regular grids:               31.9999999939       -0.0000000061
 Total charge density on r-space grids:        0.0000000051
 Total charge density g-space grids:           0.0000000051

 Overlap energy of the core charge distribution:               0.00000000005320
 Self energy of the core charge distribution:                -82.06393942512820
 Core Hamiltonian energy:                                     18.06842027191411
 Hartree energy:                                              42.41184371469986
 Exchange-correlation energy:                                 -9.71419454555998
 Electronic entropic energy:                                  -0.00001687947145
 Fermi energy:                                                 0.20867150262130

 Total energy:                                               -31.29788686349247

ENERGY| Total FORCE_EVAL ( QS ) energy (a.u.):              -31.297887031736590
</pre>

<p>
In the final energy section of the output, we notice that there is
an extra entropy \((TS)\) term:
</p>

<pre class="example">
Electronic entropic energy:                                  -0.00001687947145
</pre>

<p>
This should be small for the calculation to be a reliable
approximation to the zero electron temperature result. The final
free energy is the sum of the total DFT energy and the entropic
energy. The total DFT energy is given by:
</p>

<pre class="example">
Total energy:                                               -31.29788686349247
</pre>

<p>
and the final free energy extrapolated for \(TS \to 0\) is given by:
</p>

<pre class="example">
ENERGY| Total FORCE_EVAL ( QS ) energy (a.u.):              -31.297887031736590
</pre>

<p>
This is the energy to be quoted as the final result.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Sunday, 2014/01/26</p>
<p class="author">Author: Lianheng Tong</p>
<p class="date">Created: 2014-01-27 Mon 01:47</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5g)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
